# Unit-2

## Data Loading

### Loading the dataset

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

#### importing the data the mail data

In [3]:
import mailbox

mboxfile = "./All mail Including Spam and Trash.mbox"
mbox = mailbox.mbox(mboxfile)

for key in mbox[0].keys():
    print(key)
mbox

X-GM-THRID
X-Gmail-Labels
MIME-Version
Date
Message-ID
Subject
From
To
Content-Type

### Data transformation

#### Data cleansing

In [4]:
import csv

with open('testdata.csv','w') as outputfile:
    writing = csv.writer(outputfile)
    writing.writerow(['subject', 'from', 'date', 'to', 'label','Thread'])

    for message in mbox:
        writing.writerow([
        message['subject'],
        message['from'],
        message['date'],
        message['to'],
        message['X-Gmail-Labels'],
        message['X-GM-THRID']
        ])

#### Loading the csv file

In [5]:
dfs = pd.read_csv('testdata.csv')
dfs

,subject,from,date,to,label,Thread
0,Conceptual Physics book file,Kadarla Sai Nithin <sainithink.be25@uceou.edu>,"Wed, 11 Jan 2023 10:00:04 +0530",Suresh Kumar Lokhande <suresh.l@uceou.edu>,"Archived,Sent",1754524927945493361
1,Thank you for signing up for ThingSpeak!,ThingSpeak Support <support@mail.thingspeak.com>,"Sat, 22 Apr 2023 09:56:31 +0000",sainithink.be25@uceou.edu,"Inbox,Category Updates,Unread",1763869869345248847
2,Get the official Gmail app,Gmail Team <mail-noreply@google.com>,"Wed, 30 Nov 2022 00:05:59 -0800",Kadarla Sai Nithin <sainithink.be25@uceou.edu>,"Inbox,Unread",1750907548775931784
3,Reset Your Password,Xmind Notifications <notifications@mail.xmind....,"Tue, 16 May 2023 15:37:20 +0000",sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1766065641328425275
4,Security alert,Google <no-reply@accounts.google.com>,"Sat, 25 Feb 2023 04:51:44 GMT",sainithink.be25@uceou.edu,"Inbox,Category Updates,Unread",1758777265723926184
...,...,...,...,...,...,...
61,Verify Email Address,service@account.mathworks.com,"Sat, 22 Apr 2023 09:55:12 +0000",sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1763869787228555223
62,uceou.edu account email verification code,msonlineservicesteam@microsoftonline.com,"Sun, 19 Mar 2023 23:55:52 -0700",Sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1760868809297254026
63,uceou.edu account email verification code,msonlineservicesteam@microsoftonline.com,"Mon, 13 Mar 2023 23:40:25 -0700",Sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1760324258667829753
64,Security alert,Google <no-reply@accounts.google.com>,"Fri, 19 May 2023 10:03:42 GMT",sainithink.be25@uceou.edu,"Inbox,Opened,Category Updates",1766316440594475561
65,[Request received],"""Tech (Support)"" <agents@xmind.zendesk.com>","Wed, 08 Feb 2023 14:48:12 +0000","""sainithink.be25"" <sainithink.be25@uceou.edu>","Inbox,Category Updates,Unread",1757274643381080149

#### Converting the data

In [6]:
print(dfs.dtypes)
dfs['date'] = dfs['date'].apply(lambda x: pd.to_datetime(x,errors='coerce', utc=True))
dfs

subject    object
from       object
date       object
to         object
label      object
Thread      int64
dtype: object

,subject,from,date,to,label,Thread
0,Conceptual Physics book file,Kadarla Sai Nithin <sainithink.be25@uceou.edu>,2023-01-11 04:30:04+00:00,Suresh Kumar Lokhande <suresh.l@uceou.edu>,"Archived,Sent",1754524927945493361
1,Thank you for signing up for ThingSpeak!,ThingSpeak Support <support@mail.thingspeak.com>,2023-04-22 09:56:31+00:00,sainithink.be25@uceou.edu,"Inbox,Category Updates,Unread",1763869869345248847
2,Get the official Gmail app,Gmail Team <mail-noreply@google.com>,2022-11-30 08:05:59+00:00,Kadarla Sai Nithin <sainithink.be25@uceou.edu>,"Inbox,Unread",1750907548775931784
3,Reset Your Password,Xmind Notifications <notifications@mail.xmind....,2023-05-16 15:37:20+00:00,sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1766065641328425275
4,Security alert,Google <no-reply@accounts.google.com>,2023-02-25 04:51:44+00:00,sainithink.be25@uceou.edu,"Inbox,Category Updates,Unread",1758777265723926184
...,...,...,...,...,...,...
61,Verify Email Address,service@account.mathworks.com,2023-04-22 09:55:12+00:00,sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1763869787228555223
62,uceou.edu account email verification code,msonlineservicesteam@microsoftonline.com,2023-03-20 06:55:52+00:00,Sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1760868809297254026
63,uceou.edu account email verification code,msonlineservicesteam@microsoftonline.com,2023-03-14 06:40:25+00:00,Sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1760324258667829753
64,Security alert,Google <no-reply@accounts.google.com>,2023-05-19 10:03:42+00:00,sainithink.be25@uceou.edu,"Inbox,Opened,Category Updates",1766316440594475561
65,[Request received],"""Tech (Support)"" <agents@xmind.zendesk.com>",2023-02-08 14:48:12+00:00,"""sainithink.be25"" <sainithink.be25@uceou.edu>","Inbox,Category Updates,Unread",1757274643381080149

#### Removing NaN values

In [7]:
dfs= dfs[dfs['date'].notna()]
dfs.to_csv("gmaildata.csv")

#### Applying descriptive statistics

In [8]:
dfs.info()
dfs.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66 entries, 0 to 65
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   subject  66 non-null     object
 1   from     66 non-null     object
 2   date     66 non-null     datetime64[ns, UTC]
 3   to       66 non-null     object
 4   label    66 non-null     object
 5   Thread   66 non-null     int64
dtypes: datetime64[ns, UTC](1), int64(1), object(4)
memory usage: 3.6+ KB

,subject,from,date,to,label,Thread
0,Conceptual Physics book file,Kadarla Sai Nithin <sainithink.be25@uceou.edu>,2023-01-11 04:30:04+00:00,Suresh Kumar Lokhande <suresh.l@uceou.edu>,"Archived,Sent",1754524927945493361
1,Thank you for signing up for ThingSpeak!,ThingSpeak Support <support@mail.thingspeak.com>,2023-04-22 09:56:31+00:00,sainithink.be25@uceou.edu,"Inbox,Category Updates,Unread",1763869869345248847
2,Get the official Gmail app,Gmail Team <mail-noreply@google.com>,2022-11-30 08:05:59+00:00,Kadarla Sai Nithin <sainithink.be25@uceou.edu>,"Inbox,Unread",1750907548775931784
3,Reset Your Password,Xmind Notifications <notifications@mail.xmind....,2023-05-16 15:37:20+00:00,sainithink.be25@uceou.edu,"Inbox,Important,Opened,Category Updates",1766065641328425275
4,Security alert,Google <no-reply@accounts.google.com>,2023-02-25 04:51:44+00:00,sainithink.be25@uceou.edu,"Inbox,Category Updates,Unread",1758777265723926184

In the above output 'from' field has name and email at one column
Let's refactor it

#### Data Refactoring

In [9]:
import re

def extract_email(string):
    email = re.findall(r'<(.+?)>', string)
    if not email:
        email = list(filter(lambda y: '@' in y, string.split()))
    return email[0] if email else np.nan

dfs['from'] = dfs['from'].apply(lambda x: extract_email(x))

dfs

myemail = 'sainithink.be25@uceou.edu'
dfs['label'] = dfs['from'].apply(lambda x: 'sent' if x==myemail else 'inbox')

dfs

,subject,from,date,to,label,Thread
0,Conceptual Physics book file,sainithink.be25@uceou.edu,2023-01-11 04:30:04+00:00,Suresh Kumar Lokhande <suresh.l@uceou.edu>,sent,1754524927945493361
1,Thank you for signing up for ThingSpeak!,support@mail.thingspeak.com,2023-04-22 09:56:31+00:00,sainithink.be25@uceou.edu,inbox,1763869869345248847
2,Get the official Gmail app,mail-noreply@google.com,2022-11-30 08:05:59+00:00,Kadarla Sai Nithin <sainithink.be25@uceou.edu>,inbox,1750907548775931784
3,Reset Your Password,notifications@mail.xmind.net,2023-05-16 15:37:20+00:00,sainithink.be25@uceou.edu,inbox,1766065641328425275
4,Security alert,no-reply@accounts.google.com,2023-02-25 04:51:44+00:00,sainithink.be25@uceou.edu,inbox,1758777265723926184
...,...,...,...,...,...,...
61,Verify Email Address,service@account.mathworks.com,2023-04-22 09:55:12+00:00,sainithink.be25@uceou.edu,inbox,1763869787228555223
62,uceou.edu account email verification code,msonlineservicesteam@microsoftonline.com,2023-03-20 06:55:52+00:00,Sainithink.be25@uceou.edu,inbox,1760868809297254026
63,uceou.edu account email verification code,msonlineservicesteam@microsoftonline.com,2023-03-14 06:40:25+00:00,Sainithink.be25@uceou.edu,inbox,1760324258667829753
64,Security alert,no-reply@accounts.google.com,2023-05-19 10:03:42+00:00,sainithink.be25@uceou.edu,inbox,1766316440594475561
65,[Request received],agents@xmind.zendesk.com,2023-02-08 14:48:12+00:00,"""sainithink.be25"" <sainithink.be25@uceou.edu>",inbox,1757274643381080149

#### Dropping columns

We remove the 'to' coulmn as it contains our email only. So, we removed it

In [10]:
dfs.drop(columns='to',inplace=True)
dfs.head()

,subject,from,date,label,Thread
0,Conceptual Physics book file,sainithink.be25@uceou.edu,2023-01-11 04:30:04+00:00,sent,1754524927945493361
1,Thank you for signing up for ThingSpeak!,support@mail.thingspeak.com,2023-04-22 09:56:31+00:00,inbox,1763869869345248847
2,Get the official Gmail app,mail-noreply@google.com,2022-11-30 08:05:59+00:00,inbox,1750907548775931784
3,Reset Your Password,notifications@mail.xmind.net,2023-05-16 15:37:20+00:00,inbox,1766065641328425275
4,Security alert,no-reply@accounts.google.com,2023-02-25 04:51:44+00:00,inbox,1758777265723926184

#### Refactoring timezones

In [11]:
import datetime
import pytz

def refactor_timezone(x):
    est=pytz.timezone('US/Eastern')
    return x.astimezone(est)

dfs['date'] = dfs['date'].apply(lambda x: refactor_timezone(x))



dfs['dayofweek'] = dfs['date'].dt.strftime('%A')

dfs.head()

,subject,from,date,label,Thread,dayofweek
0,Conceptual Physics book file,sainithink.be25@uceou.edu,2023-01-10 23:30:04-05:00,sent,1754524927945493361,Tuesday
1,Thank you for signing up for ThingSpeak!,support@mail.thingspeak.com,2023-04-22 05:56:31-04:00,inbox,1763869869345248847,Saturday
2,Get the official Gmail app,mail-noreply@google.com,2022-11-30 03:05:59-05:00,inbox,1750907548775931784,Wednesday
3,Reset Your Password,notifications@mail.xmind.net,2023-05-16 11:37:20-04:00,inbox,1766065641328425275,Tuesday
4,Security alert,no-reply@accounts.google.com,2023-02-24 23:51:44-05:00,inbox,1758777265723926184,Friday

In [12]:
dfs.index = dfs['date']
#del dfs['date']

### Data Analysis

#### Number of emails

In [13]:
print(dfs.index.min().strftime('%a, %d %b %Y %I:%M %p'))
print(dfs.index.max().strftime('%a, %d %b %Y %I:%M %p'))

print(dfs['label'].value_counts())

Wed, 30 Nov 2022 03:05 AM
Wed, 24 May 2023 06:31 PM
inbox    65
sent      1
Name: label, dtype: int64

#### Time of the day

In [14]:
sent = dfs[dfs['label']=="sent"]
recieved = dfs[dfs['label']=="inbox"]

In [15]:
from matplotlib.ticker import MaxNLocator
from scipy import ndimage
import matplotlib.gridspec as gridspec
import matplotlib.patches as mpatches

In [16]:
def plot_todo_vs_year(df, ax, color='CO', s=0.5, title=''):
    ind = np.zeros(len(df), dtype='bool')
    est = pytz.timezone('US/Eastern')
    df[~ind].plot.scatter()

## Data Cleaning

### Exploring data

Importing the dataset

In [17]:
import pandas as pd

data = pd.read_csv('employee.csv')

Printing the first 5 records

In [18]:
data.head()

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
1        S Kumar   NaN  16000.0      F     Finance    G0                520
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711

Printing the last 5 records

In [19]:
data.tail()

            name   age   income gender  department grade  performance_score
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
6   James Authur  54.0      NaN      F  Operations    G3                 53
7     Josh Wills  54.0  52000.0      F     Finance    G3                901
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

listing the columns

In [20]:
print(data.columns)

Index(['name', 'age', 'income', 'gender', 'department', 'grade',
       'performance_score'],
      dtype='object')

Printing the shape of the dataframe

Output indicates --> 9 rows and 7 columns

In [21]:
print(data.shape)

(9, 7)

To check the table schema, its columns, rows, data types, and missing values in the
DataFrame

There 7 columns, 9 rows(entries) and their names, datatypes of the column, missing values, no. of datatypes present in the dataframe

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               9 non-null      object
 1   age                7 non-null      float64
 2   income             7 non-null      float64
 3   gender             7 non-null      object
 4   department         9 non-null      object
 5   grade              9 non-null      object
 6   performance_score  9 non-null      int64
dtypes: float64(2), int64(1), object(4)
memory usage: 632.0+ bytes

To check descriptive statistics of the dataframe

In [23]:
data.describe()

             age        income  performance_score
count   7.000000      7.000000           9.000000
mean   40.428571  52857.142857         610.666667
std    12.204605  26028.372797         235.671912
min    23.000000  16000.000000          53.000000
25%    31.000000  38500.000000         556.000000
50%    45.000000  52000.000000         674.000000
75%    49.500000  63500.000000         711.000000
max    54.000000  98000.000000         901.000000

The above table indicates that range of age, average age, max age and min age

### Filtering data to weed out the noise

#### Column-wise filtration

To filter columns, use filter() method

In [24]:
data.filter(['name', 'department'])

            name  department
0    Allen Smith  Operations
1        S Kumar     Finance
2    Jack Morgan     Finance
3      Ying Chin       Sales
4  Dheeraj Patel  Operations
5  Satyam Sharma       Sales
6   James Authur  Operations
7     Josh Wills     Finance
8       Leo Duck       Sales

We can also filter coulmns by slicing

In [25]:
data['name']

0      Allen Smith
1          S Kumar
2      Jack Morgan
3        Ying Chin
4    Dheeraj Patel
5    Satyam Sharma
6     James Authur
7       Josh Wills
8         Leo Duck
Name: name, dtype: object

To filter multiple columns, we need a list whereas single column list is not needed

In [26]:
data[['name', 'department']]

            name  department
0    Allen Smith  Operations
1        S Kumar     Finance
2    Jack Morgan     Finance
3      Ying Chin       Sales
4  Dheeraj Patel  Operations
5  Satyam Sharma       Sales
6   James Authur  Operations
7     Josh Wills     Finance
8       Leo Duck       Sales

We can also select a single column using python list

In [27]:
data[['name']]

            name
0    Allen Smith
1        S Kumar
2    Jack Morgan
3      Ying Chin
4  Dheeraj Patel
5  Satyam Sharma
6   James Authur
7     Josh Wills
8       Leo Duck

#### Row-wise filtration

    We can filter by using indices, slicing and conditions

    Here, axis = 0 for specifying the indices and axis = 1 for columns

    Indices

In [28]:
data.filter([1,2,3], axis=0)

          name   age   income gender department grade  performance_score
1      S Kumar   NaN  16000.0      F    Finance    G0                520
2  Jack Morgan  32.0  35000.0      M    Finance    G2                674
3    Ying Chin  45.0  65000.0      F      Sales    G3                556

    Slicing

In [29]:
data[-5:-2]

            name   age   income gender  department grade  performance_score
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
6   James Authur  54.0      NaN      F  Operations    G3                 53

    Condition-based filtration

    For single value, '==' operator     
    syntax: DataFrame[DataFrame.column_name == 'Data']

In [30]:
data[data.department=='Sales']

            name   age   income gender department grade  performance_score
3      Ying Chin  45.0  65000.0      F      Sales    G3                556
5  Satyam Sharma   NaN  62000.0    NaN      Sales    G3                649
8       Leo Duck  23.0  98000.0      M      Sales    G4                709

    For multiple values, isin() method
    syntax: DataFrame[DataFrame.column_name.isin(['value_1', 'value_2'])]

In [31]:
data[data.department.isin(['Sales', 'Operations'])]

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
6   James Authur  54.0      NaN      F  Operations    G3                 53
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

    For continuous variables, We can also use conditions like '<=' and '>='
    To Specifiy single condition:
    Syntax: DataFrame[(DataFrame.column_name <= ''Value')]

In [32]:
data[(data.performance_score >=700)]

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
7     Josh Wills  54.0  52000.0      F     Finance    G3                901
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

    To specify multiple conditions
    Syntax: DataFrame[(DataFrame.column_name <= ''Value') & (DataFrame.column_name <= ''Value')]

In [33]:
data[(data.performance_score <=700) & (data.performance_score >500)]

            name   age   income gender department grade  performance_score
1        S Kumar   NaN  16000.0      F    Finance    G0                520
2    Jack Morgan  32.0  35000.0      M    Finance    G2                674
3      Ying Chin  45.0  65000.0      F      Sales    G3                556
5  Satyam Sharma   NaN  62000.0    NaN      Sales    G3                649

    We can also use query method where we specify boolean expressions
    Syntax: DataFrame.query('boolean expression')

In [34]:
data.query('performance_score < 600')

           name   age   income gender  department grade  performance_score
1       S Kumar   NaN  16000.0      F     Finance    G0                520
3     Ying Chin  45.0  65000.0      F       Sales    G3                556
6  James Authur  54.0      NaN      F  Operations    G3                 53

### Handling missing values

#### Dropping missing values
    Using dropna(), we can remove the rows that containing the missing values

    This method has 'how' argument which takes two values 'any' and 'all'

In [35]:
data2 = pd.read_csv('employee.csv')

data2 = data2.dropna()
data2

            name   age   income gender  department grade  performance_score
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
7     Josh Wills  54.0  52000.0      F     Finance    G3                901
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

    Filling in a missing value
    
    To fill a missing value, we use mean, median and mode


    Now, Let's fill the mising values in 'age' column with mean

In [36]:
fillingsdf = pd.read_csv('employee.csv')
print(fillingsdf)

fillingsdf['age'] = fillingsdf.age.fillna(fillingsdf.age.mean())
fillingsdf

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
1        S Kumar   NaN  16000.0      F     Finance    G0                520
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
6   James Authur  54.0      NaN      F  Operations    G3                 53
7     Josh Wills  54.0  52000.0      F     Finance    G3                901
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

,name,age,income,gender,department,grade,performance_score
0,Allen Smith,45.000000,NaN,NaN,Operations,G3,723
1,S Kumar,40.428571,16000.0,F,Finance,G0,520
2,Jack Morgan,32.000000,35000.0,M,Finance,G2,674
3,Ying Chin,45.000000,65000.0,F,Sales,G3,556
4,Dheeraj Patel,30.000000,42000.0,F,Operations,G2,711
5,Satyam Sharma,40.428571,62000.0,NaN,Sales,G3,649
6,James Authur,54.000000,NaN,F,Operations,G3,53
7,Josh Wills,54.000000,52000.0,F,Finance,G3,901
8,Leo Duck,23.000000,98000.0,M,Sales,G4,709

    Now, Let's fill the mising values in 'income' column with median

In [37]:
fillingsdf['income'] = fillingsdf.income.fillna(fillingsdf.income.median())
fillingsdf

,name,age,income,gender,department,grade,performance_score
0,Allen Smith,45.000000,52000.0,NaN,Operations,G3,723
1,S Kumar,40.428571,16000.0,F,Finance,G0,520
2,Jack Morgan,32.000000,35000.0,M,Finance,G2,674
3,Ying Chin,45.000000,65000.0,F,Sales,G3,556
4,Dheeraj Patel,30.000000,42000.0,F,Operations,G2,711
5,Satyam Sharma,40.428571,62000.0,NaN,Sales,G3,649
6,James Authur,54.000000,52000.0,F,Operations,G3,53
7,Josh Wills,54.000000,52000.0,F,Finance,G3,901
8,Leo Duck,23.000000,98000.0,M,Sales,G4,709

    Now, Let's fill the missing values in 'gender' column with mode

In [38]:
fillingsdf['gender'] = fillingsdf['gender'].fillna(fillingsdf['gender'].mode()[0])
fillingsdf

,name,age,income,gender,department,grade,performance_score
0,Allen Smith,45.000000,52000.0,F,Operations,G3,723
1,S Kumar,40.428571,16000.0,F,Finance,G0,520
2,Jack Morgan,32.000000,35000.0,M,Finance,G2,674
3,Ying Chin,45.000000,65000.0,F,Sales,G3,556
4,Dheeraj Patel,30.000000,42000.0,F,Operations,G2,711
5,Satyam Sharma,40.428571,62000.0,F,Sales,G3,649
6,James Authur,54.000000,52000.0,F,Operations,G3,53
7,Josh Wills,54.000000,52000.0,F,Finance,G3,901
8,Leo Duck,23.000000,98000.0,M,Sales,G4,709

### Handling outliers

    Outliers are those points that are distinct from most of the similar points

    Dropping the outliers using the standard deviation

In [39]:
data = pd.read_csv('employee.csv')

# Dropping the outliers using the standard deviation 
upper_limit = data['performance_score'].mean() + 3 * data['performance_score'].std()
lower_limit = data['performance_score'].mean() - 3 * data['performance_score'].std()

# Upper limit = mean + 3*std
# Lower limit = mean - 3*std

data_filtered = data[ (data['performance_score'] < upper_limit) & (data['performance_score'] > lower_limit) ]

print(data)
print()
print(data_filtered)

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
1        S Kumar   NaN  16000.0      F     Finance    G0                520
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
6   James Authur  54.0      NaN      F  Operations    G3                 53
7     Josh Wills  54.0  52000.0      F     Finance    G3                901
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
1        S Kumar   NaN  16000.0      F     Finance    G0                520
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
6   James Authur  54.0      NaN      F  Operations    G3                 53
7     Josh Wills  54.0  52000.0      F     Finance    G3                901
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

    Now, Let's remove the outliers using the percentile values

In [40]:
data = pd.read_csv('employee.csv')

# Using the percentile values to filter outliers of the data  

upper_limit = data['performance_score'].quantile(0.99)
lower_limit = data['performance_score'].quantile(0.01)

data_filtered = data[(data['performance_score'] < upper_limit) & (data['performance_score'] > lower_limit)]

print(data)
print()
print(data_filtered)

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
1        S Kumar   NaN  16000.0      F     Finance    G0                520
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
6   James Authur  54.0      NaN      F  Operations    G3                 53
7     Josh Wills  54.0  52000.0      F     Finance    G3                901
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
1        S Kumar   NaN  16000.0      F     Finance    G0                520
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
8       Leo Duck  23.0  98000.0      M       Sales    G4                709

### Feature encoding techniques

#### One-hot encoding
    One-hot encoding transforms the categorical column into labels and splits the column into multiple columns

    To perform one-hot encoding, use get_dummies() method

In [41]:
data = pd.read_csv('employee.csv')

encoded_data = pd.get_dummies(data['gender'])

data = data.join(encoded_data)

data

,name,age,income,gender,department,grade,performance_score,F,M
0,Allen Smith,45.0,NaN,NaN,Operations,G3,723,0,0
1,S Kumar,NaN,16000.0,F,Finance,G0,520,1,0
2,Jack Morgan,32.0,35000.0,M,Finance,G2,674,0,1
3,Ying Chin,45.0,65000.0,F,Sales,G3,556,1,0
4,Dheeraj Patel,30.0,42000.0,F,Operations,G2,711,1,0
5,Satyam Sharma,NaN,62000.0,NaN,Sales,G3,649,0,0
6,James Authur,54.0,NaN,F,Operations,G3,53,1,0
7,Josh Wills,54.0,52000.0,F,Finance,G3,901,1,0
8,Leo Duck,23.0,98000.0,M,Sales,G4,709,0,1

    Previously, we have used geet_dummies() method
    
    Now, Let's use OneHotEncoder from scikit-learn module

In [42]:
from sklearn.preprocessing import OneHotEncoder

onehotencoder = OneHotEncoder()

data['gender'] = data['gender'].fillna(data['gender'].mode()[0])

print(onehotencoder.fit_transform(data[['gender']]).toarray())

[[1. 0.]
 [1. 0.]
 [0. 1.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [1. 0.]
 [0. 1.]]

#### Label encoding
    Label encoding is also known as integer encoding. Integer encoding replaces categorical values with numeric values

    Here, the unique values in variables are replaced with a sequence of integer values

In [43]:
from sklearn.preprocessing import LabelEncoder

data = pd.read_csv('employee.csv')

labelencoder = LabelEncoder()

encoded_data = labelencoder.fit_transform(data['department'])

print(encoded_data)

data['Encoded department'] = encoded_data

data

[1 0 0 2 1 2 1 0 2]

,name,age,income,gender,department,grade,performance_score,Encoded department
0,Allen Smith,45.0,NaN,NaN,Operations,G3,723,1
1,S Kumar,NaN,16000.0,F,Finance,G0,520,0
2,Jack Morgan,32.0,35000.0,M,Finance,G2,674,0
3,Ying Chin,45.0,65000.0,F,Sales,G3,556,2
4,Dheeraj Patel,30.0,42000.0,F,Operations,G2,711,1
5,Satyam Sharma,NaN,62000.0,NaN,Sales,G3,649,2
6,James Authur,54.0,NaN,F,Operations,G3,53,1
7,Josh Wills,54.0,52000.0,F,Finance,G3,901,0
8,Leo Duck,23.0,98000.0,M,Sales,G4,709,2

    We can also inversely transform categorical values i.e integer values to categorical values

In [44]:
inverse_encoded_data = labelencoder.inverse_transform([0,2,1])
print(inverse_encoded_data)

['Finance' 'Sales' 'Operations']

#### Ordinal encoding
    It except there's an order to the encoding. The output encoding starts from 0 to N-1

    We can define the order of the values as a list and pass it to the category parameter
    The ordinal encoder uses the integer or numeric values to encode where they ordinal in nature

In [45]:
from sklearn.preprocessing import OrdinalEncoder

data = pd.read_csv('employee.csv')
 
ordinalencoder = OrdinalEncoder(categories=[['G0', 'G1', 'G2', 'G3', 'G4']])
data['grade_encoded'] = ordinalencoder.fit_transform(data[['grade']])

data.head()

,name,age,income,gender,department,grade,performance_score,grade_encoded
0,Allen Smith,45.0,NaN,NaN,Operations,G3,723,3.0
1,S Kumar,NaN,16000.0,F,Finance,G0,520,0.0
2,Jack Morgan,32.0,35000.0,M,Finance,G2,674,2.0
3,Ying Chin,45.0,65000.0,F,Sales,G3,556,3.0
4,Dheeraj Patel,30.0,42000.0,F,Operations,G2,711,2.0

### Missing values

In [46]:
air_data = pd.read_csv('Airdata.csv')
air_data

,DateTime,Temperature,Humidity,Wind_Speed,Wind_Direction,NO2_Location_A,NO2_Location_B,NO2_Location_C
0,1/1/2020 0:00,2.180529,87,1.484318,75.963760,39.23,52.88,62.37
1,1/1/2020 1:00,1.490529,89,2.741678,113.198590,38.30,44.95,52.53
2,1/1/2020 2:00,1.690529,85,3.563818,135.000000,NaN,48.40,54.80
3,1/1/2020 3:00,1.430529,84,2.811690,129.805570,37.28,47.18,50.80
4,1/1/2020 4:00,0.840529,86,1.800000,126.869896,29.97,41.48,54.43
...,...,...,...,...,...,...,...,...
8779,12/31/2020 19:00,4.920528,72,4.553680,251.565060,53.44,32.65,66.82
8780,12/31/2020 20:00,4.990529,74,3.259939,186.340200,49.80,34.03,67.31
8781,12/31/2020 21:00,4.360529,84,10.587917,252.181120,43.32,25.55,59.33
8782,12/31/2020 22:00,3.820528,88,8.435069,219.805570,39.88,19.90,43.70
8783,12/31/2020 23:00,3.170529,89,6.792466,212.005390,39.04,30.33,46.87

In [47]:
air_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8784 entries, 0 to 8783
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   DateTime        8784 non-null   object
 1   Temperature     8784 non-null   float64
 2   Humidity        8784 non-null   int64
 3   Wind_Speed      8784 non-null   float64
 4   Wind_Direction  8784 non-null   float64
 5   NO2_Location_A  8664 non-null   float64
 6   NO2_Location_B  8204 non-null   float64
 7   NO2_Location_C  8652 non-null   float64
dtypes: float64(6), int64(1), object(1)
memory usage: 549.1+ KB

In [53]:
print('missing values in the given dataset\n--------------------------------')
for col in air_data.columns:
    nvm = sum(air_data[col].isna())
    print('{}: {}'.format(col,nvm))

missing values in the given dataset
--------------------------------
DateTime: 0
Temperature: 0
Humidity: 0
Wind_Speed: 0
Wind_Direction: 0
NO2_Location_A: 120
NO2_Location_B: 580
NO2_Location_C: 132